In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
#index Levels
outside = 'G1 G1 G1 G2 G2 G2'.split()
inside = [1,2,3,1,2,3]
hier_index= list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [3]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [4]:
df = pd.DataFrame(randn(6,2), hier_index,['A','B'])

In [5]:
df

             A         B
G1 1 -0.800029  0.574802
   2 -0.355797 -1.056161
   3  0.689590  2.003709
G2 1  1.237515 -0.702387
   2 -0.791274  0.721910
   3  0.169743 -2.270737

In [6]:
df.loc['G1']

          A         B
1 -0.800029  0.574802
2 -0.355797 -1.056161
3  0.689590  2.003709

In [7]:
df.loc['G1'].loc[1] #This will print the first index, first row

A   -0.800029
B    0.574802
Name: 1, dtype: float64

In [8]:
df.index.names = ['Groups','Numbers']

In [9]:
df

                       A         B
Groups Numbers
G1     1       -0.800029  0.574802
       2       -0.355797 -1.056161
       3        0.689590  2.003709
G2     1        1.237515 -0.702387
       2       -0.791274  0.721910
       3        0.169743 -2.270737

In [10]:
df.loc['G2'].loc[2]['B'] #or df.loc['G2'].loc[2][1]

0.7219104644681826

In [11]:
df.xs #cross section

<bound method NDFrame.xs of                        A         B
Groups Numbers
G1     1       -0.800029  0.574802
       2       -0.355797 -1.056161
       3        0.689590  2.003709
G2     1        1.237515 -0.702387
       2       -0.791274  0.721910
       3        0.169743 -2.270737>

In [12]:
df.xs('G1')

                A         B
Numbers
1       -0.800029  0.574802
2       -0.355797 -1.056161
3        0.689590  2.003709

In [13]:
df.xs(1,level='Numbers')

               A         B
Groups
G1     -0.800029  0.574802
G2      1.237515 -0.702387

In [15]:
#Missing Values
d = {'A': [1,2,np.nan],'B': [5,np.nan,np.nan], 'C': [1,2,3]}

In [16]:
df = pd.DataFrame(d)

In [23]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:

df.dropna() #will drop all the rows with a null value

     A    B  C
0  1.0  5.0  1

In [25]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [27]:
df.dropna(thresh=2) # row 1 had t empty value hence kept it: this is for defining the threshold

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [28]:
#Filling empty Values

In [29]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [30]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby Functions

In [31]:
data = {
    'Company' : ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales' : [200,120,340,124,243,350]
}

In [37]:
df = pd.DataFrame(data)

In [38]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [40]:
#Group by Company
byComp = df.groupby('Company')

In [42]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [43]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [44]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [45]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [47]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [48]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [52]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [54]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [57]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [58]:
df.head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243

In [60]:
df['Sales'].nunique()

6

In [61]:
df['Sales'].value_counts()

120    1
350    1
340    1
124    1
243    1
200    1
Name: Sales, dtype: int64

In [65]:
df[(df['Sales'] > 200) & (df['Sales'] == 350)]

  Company Person  Sales
5      FB  Sarah    350

In [66]:
df['Sales'] > 200

0    False
1    False
2     True
3    False
4     True
5     True
Name: Sales, dtype: bool

In [68]:
def times2(x):
    return x*2

In [70]:
df['Sales'].apply(times2)  #apply a function

0    400
1    240
2    680
3    248
4    486
5    700
Name: Sales, dtype: int64

In [72]:
df['Sales'].apply(lambda x: x*2) #use above as a lambda expression

0    400
1    240
2    680
3    248
4    486
5    700
Name: Sales, dtype: int64

In [73]:
#removing Columns

In [74]:
#removing column1

In [75]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [80]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [81]:
#Sort bu Column2

In [82]:
df.sort_values('Person')

  Company   Person  Sales
2    MSFT      Amy    340
4      FB     Carl    243
1    GOOG  Charlie    120
0    GOOG      Sam    200
5      FB    Sarah    350
3    MSFT  Vanessa    124

In [83]:
df.isnull()

   Company  Person  Sales
0    False   False  False
1    False   False  False
2    False   False  False
3    False   False  False
4    False   False  False
5    False   False  False

In [84]:
PWD

NameError: name 'PWD' is not defined

In [85]:
pwd

'C:\\Users\\maina\\Documents\\Digital Academy\\Data Science\\DS_Crash_Course_labs'